_wiki/2015-08-07-swap-file.html
---
collections: wiki
layout: post
title: Swap File
date: 2015-08-07
categories: 
-
tags: 
- swap
- linux
author: carltonf
excerpt: Use swap file in Linux
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Swap file</h2>
<div class="outline-text-2" id="text-1">
<p>
Swap file is more flexible than swap partition.
</p>

<ul class="org-ul">
<li>Use file as swap space.

<div class="org-src-container">

<pre class="src src-shell-script"><span style="color: #b22222;"># </span><span style="color: #b22222;">create a 4G swap image</span>
dd <span style="color: #a0522d;">if</span>=/dev/zero <span style="color: #a0522d;">of</span>=swap.img <span style="color: #a0522d;">bs</span>=1024M <span style="color: #a0522d;">count</span>=4
mkswap swap.img

<span style="color: #b22222;"># </span><span style="color: #b22222;">see the currently used swap space</span>
swapon -s

<span style="color: #b22222;"># </span><span style="color: #b22222;">mount this file as swap space</span>
swapon swap.img
</pre>
</div>

<p>
Optionally you can use <code>swapoff</code> to disable some swap space.
</p>
</li>

<li>Persistent 

<p>
Add this entry into <code>/etc/fstab</code>
</p>
<div class="org-src-container">

<pre class="src src-conf-space"><span style="color: #a0522d;">/opt/swap.img</span>  none            swap    defaults        0       0
</pre>
</div>
</li>
</ul>
</div>
</div>
